---
<center><h1>Lesson 6 - SQL with Python. Relational databases</h1></center>

---


<center><h1>Part 2. SQL syntax and basic commands</h1></center>

---

# Table of Contents


- [Syntax and basic commands](#Syntax-and-basic-commands)
    - [`CREATE DATABASE` and `SHOW DATABASES`](#CREATE-DATABASE-and-SHOW-DATABASES)
    - [`DROP DATABASE`](#DROP-DATABASE)
    - [Database selection: `USE` Statement](#Database-selection:-USE-Statement)
    - [`CREATE TABLE` and `DESC` command](#CREATE-TABLE-and-DESC-command)
    - [Delete table: `DROP TABLE` statement](#Delete-table:-DROP-TABLE-statement)
    - [Records addition: `INSERT` query](#Records-addition:-INSERT-query)
    - [`SELECT` query](#SELECT-query)
    - [`DISTINCT` keyword](#DISTINCT-keyword)
    - [`WHERE` clause](#WHERE-clause)
        - [*Exercise 2.1*](#Exercise-2.1)
        - [*Exercise 2.2*](#Exercise-2.2)
        - [*Exercise 2.3*](#Exercise-2.3)
    - [`UPDATE` query](#UPDATE-query)
    - [`DELETE` query](#DELETE-query)
    - [`LIMIT` and `OFFSET` clauses](#LIMIT-and-OFFSET-clauses)
    - [Sorting: `ORDER BY` clause](#Sorting:-ORDER-BY-clause)
    - [Grouping: `GROUP BY` clause](#Grouping:-GROUP-BY-clause)
    - [Setting conditions on the grouping records: `HAVING` clause](#Setting-conditions-on-the-grouping-records:-HAVING-clause)
        - [*Exercise 2.4*](#Exercise-2.4)
        - [*Exercise 2.5*](#Exercise-2.5)
        - [*Exercise 2.6*](#Exercise-2.6)
    - [Remove all table record: `TRANCATE` statement](#Remove-all-table-record:-TRANCATE-statement)
    - [Add, delete, modify columns: `ALTER TABLE` statement](#Add,-delete,-modify-columns:-ALTER-TABLE-statement)
    - [SQL joins](#SQL-joins)
        - [`INNER JOIN clause`](#INNER-JOIN-clause)
        - [`LEFT JOIN clause`](#LEFT-JOIN-clause)
        - [`RIGHT JOIN clause`](#RIGHT-JOIN-clause)
    - [`UNION` clause/operator](#UNION-clause/operator)
    - [`NULL` values](#NULL-values)
    - [Subquery](#Subquery)
    - [Some Date functions](#Some-Date-functions)
        - [*Exercise 2.7*](#Exercise-2.7)
        - [*Exercise 2.8*](#Exercise-2.8)
        - [*Exercise 2.9*](#Exercise-2.9)

---

# Syntax and basic commands

[[back to top]](#Table-of-Contents)

All the SQL statements start with any of the keywords like SELECT, INSERT, UPDATE, DELETE, ALTER, DROP, CREATE, USE, SHOW and all the statements end with a semicolon (;).

Important point to be noted is that SQL is case insensitive, which means SELECT and select have same meaning in SQL statements, but MySQL makes difference in table names. So if you are working with MySQL, then you need to give table names as they exist in the database.

### `CREATE DATABASE` and `SHOW DATABASES`

[[back to top]](#Table-of-Contents)

The SQL `CREATE DATABASE` statement is used to create new SQL database.

**Syntax:**

    CREATE DATABASE database_name;

Always database name should be unique within the RDBMS.

In [528]:
# Load the ipython-sql extension
%load_ext sql 
# Connect to MySQL server
%sql mysql://root:vagrant@localhost:3306/

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

u'Connected: root@'

In [529]:
# NOTE: If you have any unexpected errors in this lesson, try to run this cell. It will delete all databases.
# And after that run again all cells.
#%sql DROP DATABASE my_first_db;
#%sql DROP DATABASE my_db;
#%sql DROP DATABASE example_db;

In [530]:
%sql CREATE DATABASE my_first_db;

1 rows affected.

[]

Make sure you have admin privilege before creating any database. Once a database is created, you can check it in the list of databases as follows:

In [531]:
%sql SHOW DATABASES;

4 rows affected.

[('information_schema',),
 ('my_first_db',),
 ('mysql',),
 ('performance_schema',)]

### `DROP DATABASE`

[[back to top]](#Table-of-Contents)

The SQL `DROP DATABASE` statement is used to drop an existing database in SQL schema.

**Syntax:**

    DROP DATABASE database_name;

In [532]:
%sql DROP DATABASE my_first_db;

0 rows affected.

[]

In [533]:
%sql SHOW DATABASES;

3 rows affected.

[('information_schema',), ('mysql',), ('performance_schema',)]

In [534]:
# We need a database for our work. 
# So, Let's create a new one
%sql CREATE DATABASE my_db;

1 rows affected.

[]

### Database selection: `USE` Statement

[[back to top]](#Table-of-Contents)

When you have multiple databases in your SQL Schema, then before starting your operation, you would need to select a database where all the operations would be performed.

The SQL `USE` statement is used to select any existing database in SQL schema.

**Syntax:**

    USE DatabaseName;

In [535]:
%sql USE my_db;

0 rows affected.

[]

### `CREATE TABLE` and `DESC` command

[[back to top]](#Table-of-Contents)

Creating a basic table involves naming the table and defining its columns and each column's data type.

The SQL `CREATE TABLE` statement is used to create a new table.

**Syntax:**

    CREATE TABLE table_name(
       column1 datatype,
       column2 datatype,
       column3 datatype,
       .....
       columnN datatype,
       PRIMARY KEY( one or more columns )
    );

In brackets comes the list defining each column in the table and what sort of data type it is. The syntax becomes clearer with an example below.

In [536]:
%sql CREATE TABLE employee ( \
   ID              INT              NOT NULL,     /* Unique identifier of the record */ \
   name            VARCHAR (20)     NOT NULL,     /* Employee name */ \
   surname         VARCHAR (40)     NOT NULL,     /* Employee surname */ \
   age             INT              NOT NULL,     /* Employee age */ \
   admission_date  DATE             NOT NULL,     /* The date of admission to the job */ \
   address         CHAR (25),                     /* Employee address (is not required) */ \
   salary          DECIMAL (18, 2),               /* Employee salary (is not required) */ \
   PRIMARY KEY (ID) \
);

0 rows affected.

[]

Here:

* `NOT NULL` ensures that a column cannot have `NULL` value.
* `PRIMARY KEY` uniquely identifies each rows/records in a database table.

You can use also the following constraints:

* `DEFAULT`: provides a default value for a column when none is specified.
* `UNIQUE`: ensures that all values in a column are different.
* `FOREIGN Key`: uniquely identifies a rows/records in any another database table.

`/* comment_text */` is a comment in SQL.

You can verify if your table has been created successfully by looking at the message displayed by the SQL server, otherwise you can use `DESC` command as follows:

In [537]:
%sql DESC employee;

7 rows affected.

[('ID', 'int(11)', 'NO', 'PRI', None, ''),
 ('name', 'varchar(20)', 'NO', '', None, ''),
 ('surname', 'varchar(40)', 'NO', '', None, ''),
 ('age', 'int(11)', 'NO', '', None, ''),
 ('admission_date', 'date', 'NO', '', None, ''),
 ('address', 'char(25)', 'YES', '', None, ''),
 ('salary', 'decimal(18,2)', 'YES', '', None, '')]

### Delete table: `DROP TABLE` statement

[[back to top]](#Table-of-Contents)

The SQL `DROP TABLE` statement is used to remove a table definition and all data, indexes, triggers, constraints, and permission specifications for that table.

> **NOTE:** You have to be careful while using this command because once a table is deleted then all the information available in the table would also be lost forever.

**Syntax:**

    DROP TABLE table_name;

### Records addition: `INSERT` query

[[back to top]](#Table-of-Contents)

The SQL `INSERT INTO` statement is used to add new rows of data to a table in the database.

**Syntax:**

    INSERT INTO table_name (column1, column2, column3, ..., columnN)]  
    VALUES (value1, value2, value3, ..., valueN);

Here, `column1, column2,...columnN` are the names of the columns in the table into which you want to insert data.

You may not need to specify the column(s) name in the SQL query if you are adding values for all the columns of the table. But make sure the order of the values is in the same order as the columns in the table. The SQL `INSERT INTO` syntax would be as follows:

    INSERT INTO table_name VALUES (value1, value2, value3, ..., valueN);

In [538]:
%sql INSERT INTO employee (ID, name, surname, age, admission_date, address, salary) \
VALUES (1, 'James', 'Smith', 32, '2008-11-11', 'New York', 2000.00);

1 rows affected.

[]

In [539]:
%sql INSERT INTO employee \
VALUES (2, 'Robert', 'Brown', 28, '2008-07-01', 'Jersey City', 3500.00);

1 rows affected.

[]

### `SELECT` query

[[back to top]](#Table-of-Contents)

SQL `SELECT` statement is used to fetch the data from a database table which returns data in the form of result table. These result tables are called result-sets.

**Syntax:**

    SELECT column1, column2, ..., columnN FROM table_name;

Here, `column1, column2, ..., columnN` are the fields of a table whose values you want to fetch. If you want to fetch all the fields available in the field, then you can use the following syntax:

    SELECT * FROM table_name;

In [540]:
%sql SELECT * FROM employee;

2 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00')),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00'))]

In [541]:
%sql SELECT surname, name, salary FROM employee;

2 rows affected.

[('Smith', 'James', Decimal('2000.00')),
 ('Brown', 'Robert', Decimal('3500.00'))]

In [542]:
# Insert some additional record to the table
%sql \
INSERT INTO employee VALUES (3,  'Susan',     'Johnson',  38, '2009-05-21', 'New York',    3700.00); \
INSERT INTO employee VALUES (4,  'Michael',   'Williams', 33, '2010-02-02', 'New York',    2100.00); \
INSERT INTO employee VALUES (5,  'Richard',   'Philips',  28, '2009-09-27', 'Jersey City', 4500.00); \
INSERT INTO employee VALUES (6,  'Elizabeth', 'Davis',    23, '2009-06-21', 'New York',    3800.00); \
INSERT INTO employee VALUES (7,  'Susan',     'Miller',   45, '2009-05-12', 'Newark',      4100.00); \
INSERT INTO employee VALUES (8,  'Donna',     'Taylor',   41, '2010-05-08', 'New Jersey',  1800.00); \
INSERT INTO employee VALUES (9,  'David',     'Thompson', 24, '2011-11-09', 'Greenwich',   2700.00); \
INSERT INTO employee VALUES (10, 'Thomas',    'Allen',    23, '2008-01-15', 'New York',    2800.00); \
INSERT INTO employee VALUES (11, 'Joseph',    'Taylor',   24, '2009-07-24', 'New York',    3700.00); \
INSERT INTO employee VALUES (12, 'George',    'Harris',   28, '2009-08-17', 'Stamfod',     2700.00); \
INSERT INTO employee VALUES (13, 'Brian',     'Jackson',  36, '2009-05-05', 'Stamfod',     2000.00); \
INSERT INTO employee VALUES (14, 'Steven',    'Philips',  48, '2008-02-20', 'Jersey City', 2500.00); \
INSERT INTO employee VALUES (15, 'Barbara',   'Morgan',   38, '2008-03-10', 'New York',    3500.00); \
INSERT INTO employee VALUES (16, 'Sarah',     'Taylor',   32, '2009-04-24', 'Edison',      4700.00);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [543]:
# Let's look at our table now
%sql SELECT * FROM employee;

16 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00')),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00')),
 (4L, 'Michael', 'Williams', 33L, datetime.date(2010, 2, 2), 'New York', Decimal('2100.00')),
 (5L, 'Richard', 'Philips', 28L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4500.00')),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('1800.00')),
 (9L, 'David', 'Thompson', 24L, datetime.date(2011, 11, 9), 'Greenwich', Decimal('2700.00')),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00')),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00')),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00')),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2000.00')),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('2500.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('3500.00')),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'))]

### `DISTINCT` keyword

[[back to top]](#Table-of-Contents)

The SQL `DISTINCT` keyword is used in conjunction with `SELECT` statement to eliminate all the duplicate records and fetching only unique records.

There may be a situation when you have multiple duplicate records in a table. While fetching such records, it makes more sense to fetch only unique records instead of fetching duplicate records.

**Syntax:**

    SELECT DISTINCT column1, column2, ..., columnN 
    FROM table_name;

In [544]:
%sql SELECT DISTINCT address FROM employee;

7 rows affected.

[('New York',),
 ('Jersey City',),
 ('Newark',),
 ('New Jersey',),
 ('Greenwich',),
 ('Stamfod',),
 ('Edison',)]

In [545]:
%sql SELECT DISTINCT address, age FROM employee;

13 rows affected.

[('New York', 32L),
 ('Jersey City', 28L),
 ('New York', 38L),
 ('New York', 33L),
 ('New York', 23L),
 ('Newark', 45L),
 ('New Jersey', 41L),
 ('Greenwich', 24L),
 ('New York', 24L),
 ('Stamfod', 28L),
 ('Stamfod', 36L),
 ('Jersey City', 48L),
 ('Edison', 32L)]

### `WHERE` clause

[[back to top]](#Table-of-Contents)

The SQL `WHERE` clause is used to specify a condition while fetching the data from single table or joining with multiple tables.

If the given condition is satisfied then only it returns specific value from the table. You would use WHERE clause to filter the records and fetching only necessary records.

The WHERE clause is not only used in `SELECT` statement, but it is also used in `UPDATE`, `DELETE` statements (see below), etc.

**Syntax:**

    SELECT column1, column2, ..., columnN 
    FROM table_name
    WHERE [conditions]

You can specify a condition using comparison or logical operators. Assume variable `a` holds 10 and variable `b` holds 20, then:

**SQL Arithmetic Operators:**

|Operator|Description|Example|
|-----|-----|-----|
|`+`|Addition - Adds values on either side of the operator|`a + b` will give 30|
|`-`|Subtraction - Subtracts right hand operand from left hand operand|`a - b` will give -10|
|`*`|Multiplication - Multiplies values on either side of the operator|`a * b` will give 200|
|`/`|Division - Divides left hand operand by right hand operand|`b / a` will give 2|
|`%`|Modulus - Divides left hand operand by right hand operand and returns remainder|`b % a` will give 0|

**SQL Comparison Operators:**

|Operator|Description|Example|
|-----|-----|-----|
|`=`|Checks if the values of two operands are equal or not, if yes then condition becomes true|`a = b` is `False`|
|`!=` (or `<>`)|Checks if the values of two operands are equal or not, if values are not equal then condition becomes true|`a != b` is `True`|
|`>`|Checks if the value of left operand is greater than the value of right operand, if yes then condition becomes true|`a > b` is `False`|
|`<`|Checks if the value of left operand is less than the value of right operand, if yes then condition becomes true|`a < b` is `True`|
|`>=`|Checks if the value of left operand is greater than or equal to the value of right operand, if yes then condition becomes true|`a >= b` is `False`|
|`<=`|Checks if the value of left operand is less than or equal to the value of right operand, if yes then condition becomes true|`a <= b` is `True`|
|`!<`|Checks if the value of left operand is not less than the value of right operand, if yes then condition becomes true|`a !< b` is `False`|
|`!>`|Checks if the value of left operand is not greater than the value of right operand, if yes then condition becomes true|`a !> b` is `True`|

**SQL Logical Operators:**

|Operator|Description|
|-----|-----|
|`ALL`|Is used to compare a value to all values in another value set|
|`AND`|Allows the existence of multiple conditions in an SQL statement's `WHERE` clause|
|`ANY`|Is used to compare a value to any applicable value in the list according to the condition|
|`BETWEEN`|Is used to search for values that are within a set of values, given the minimum value and the maximum value|
|`EXISTS`|Is used to search for the presence of a row in a specified table that meets certain criteria|
|`IN`|Is used to compare a value to a list of literal values that have been specified|
|`LIKE`|Is used to compare a value to similar values using wildcard operators|
|`NOT`|Reverses the meaning of the logical operator with which it is used. Eg: `NOT EXISTS`, `NOT BETWEEN`, `NOT IN`, etc. This is a negate operator|
|`OR`|Is used to combine multiple conditions in an SQL statement's `WHERE` clause|
|`IS NULL`|Is used to compare a value with a `NULL` value|
|`UNIQUE`|Searches every row of a specified table for uniqueness (no duplicates)|

In [546]:
# Select all employees with salary larger than 3500
%sql SELECT * FROM employee WHERE salary > 3500;

6 rows affected.

[(3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00')),
 (5L, 'Richard', 'Philips', 28L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4500.00')),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00')),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'))]

In [547]:
# Select all employees whose name is Susan
%sql SELECT * FROM employee WHERE name = 'Susan';

2 rows affected.

[(3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00'))]

In [548]:
# Select all employees who lives in New York and has the salary from 2500 to 3500 inclusively
%sql SELECT * FROM employee WHERE address = 'New York' AND salary BETWEEN 2500 AND 3500;
# is equivalently to
# %sql SELECT * FROM employee WHERE address = 'New York' AND salary >= 2500 AND salary <= 3500;

2 rows affected.

[(10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('3500.00'))]

In [549]:
# Select all employees whose name starts with "S" and age is in range(28, 38, 45)
# The "%" sign is used in LIKE operator to define wildcards (missing letters) both before and after the pattern. 
# You will learn more about wildcards in the next chapter
%sql SELECT * FROM employee WHERE name LIKE 'S%' OR age IN (38, 45, 28);

8 rows affected.

[(2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00')),
 (5L, 'Richard', 'Philips', 28L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4500.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00')),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('2500.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('3500.00')),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'))]

The SQL `LIKE` clause is used to compare a value to similar values using wildcard operators. There are two _wildcards_ used in conjunction with the `LIKE` operator:

* The percent sign (`%`)
* The underscore (`_`)

The percent sign represents zero, one, or multiple characters. The underscore represents a single number or character. The symbols can be used in combinations.

Here are number of examples showing `WHERE` part having different `LIKE` clause with `%` and `_` operators:

|Statement|Description|
|-----|-----|
|`WHERE SALARY LIKE '200%'`|Finds any values that start with 200|
|`WHERE SALARY LIKE '%200%'`|Finds any values that have 200 in any position|
|`WHERE SALARY LIKE '_00%'`|Finds any values that have 00 in the second and third positions|
|`WHERE SALARY LIKE '2_%_%'`|Finds any values that start with 2 and are at least 3 characters in length|
|`WHERE SALARY LIKE '%2'`|Finds any values that end with 2|
|`WHERE SALARY LIKE '_2%3'`|Finds any values that have a 2 in the second position and end with a 3|
|`WHERE SALARY LIKE '2___3'`|Finds any values in a five-digit number that start with 2 and end with 3|

> ### Exercise 2.1:

> Select only those records, where city is not equal to "New York". Write results to the `result` variable.

In [550]:
# type your code here
result = %sql SELECT * FROM employee WHERE address != 'New York'
result

9 rows affected.

[(2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (5L, 'Richard', 'Philips', 28L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4500.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('1800.00')),
 (9L, 'David', 'Thompson', 24L, datetime.date(2011, 11, 9), 'Greenwich', Decimal('2700.00')),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00')),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2000.00')),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('2500.00')),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'))]

In [551]:
from test_helper import Test

Test.assertEqualsHashed(result, '0c7a03d65fa93e46a4fd9a082e98e7fd6c4b67a9','Incorrect sql query', "Exercise 2.1 is successful")

1 test passed. Exercise 2.1 is successful

> ### Exercise 2.2:

> Select only those records, where salary is not less than 3000 and age is less than 30. Write results to the `result` variable.

In [552]:
# type your code here
result = %sql SELECT * FROM employee WHERE salary >= 3000 AND age < 30
result

4 rows affected.

[(2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (5L, 'Richard', 'Philips', 28L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4500.00')),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00'))]

In [553]:
Test.assertEqualsHashed(result, '107749dfea045f2b8d3807283af99aa9dd87917a', 'Incorrect sql query', "Exercise 2.2 is successful")

1 test passed. Exercise 2.2 is successful

> ### Exercise 2.3:

> Select those employees whose name or surname contains "an". Write results to the `result` variable.

In [554]:
# type your code here
result = %sql SELECT * FROM employee WHERE name LIKE '%an%' OR surname LIKE '%an%'
result

4 rows affected.

[(3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2000.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('3500.00'))]

In [555]:
Test.assertEqualsHashed(result.DataFrame()['name'], '0eaa4da747245352903fcdc518096f197913672b', 
                                                    'Incorrect sql query', "Exercise 2.3 is successful")

1 test passed. Exercise 2.3 is successful

### `UPDATE` query

[[back to top]](#Table-of-Contents)

The SQL `UPDATE` query is used to modify the existing records in a table.

You can use `WHERE` clause with `UPDATE` query to update selected rows otherwise all the rows would be affected.

**Syntax:**

    UPDATE table_name
    SET column1 = value1, column2 = value2, ...., columnN = valueN
    WHERE [conditions];

In [556]:
# Let's update some values of employee with ID = 5
%sql SELECT * FROM employee WHERE ID = 5

1 rows affected.

[(5L, 'Richard', 'Philips', 28L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4500.00'))]

In [557]:
# We will update salary and age
%sql UPDATE employee \
     SET salary = 4800, age = 29 \
     WHERE ID = 5;

1 rows affected.

[]

In [558]:
# Look at changes
%sql SELECT * FROM employee WHERE ID = 5

1 rows affected.

[(5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00'))]

### `DELETE` query

[[back to top]](#Table-of-Contents)

The SQL `DELETE` query is used to delete the existing records from a table. You can use `WHERE` clause with `DELETE` query to delete selected rows, otherwise all the records would be deleted.

**Syntax:**

    DELETE FROM table_name
    WHERE [conditions];

If you want to delete all the records from the table, you do not need to use `WHERE` clause with `DELETE` query:

    DELETE FROM table_name;

In [559]:
# Look at records with ID between 5 and 9
%sql SELECT * FROM employee WHERE ID BETWEEN 5 AND 10

6 rows affected.

[(5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00')),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('1800.00')),
 (9L, 'David', 'Thompson', 24L, datetime.date(2011, 11, 9), 'Greenwich', Decimal('2700.00')),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00'))]

In [560]:
# Delete employee with ID = 8 and display updated table
%sql DELETE FROM employee WHERE ID = 9; \
SELECT * FROM employee WHERE ID BETWEEN 5 AND 10;

1 rows affected.
5 rows affected.

[(5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00')),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('1800.00')),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00'))]

### `LIMIT` and `OFFSET` clauses

[[back to top]](#Table-of-Contents)

The SQL `TOP` clause is used to fetch a `TOP` `N` number or `X` percent records from a table.

**Syntax:**

    SELECT column-list
    FROM table_name
    WHERE [conditions]
    LIMIT number;

`OFFSET` says to skip that many rows before beginning to return rows. If both `OFFSET` and `LIMIT` appear, then `OFFSET` rows are skipped before starting to count the `LIMIT`  rows that are returned.

**Syntax:**

    SELECT column-list
    FROM table_name
    WHERE [conditions]
    LIMIT number_1 OFFSET number_2;

In [561]:
%sql SELECT * FROM employee LIMIT 3;

3 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00')),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00'))]

In [562]:
%sql SELECT * FROM employee LIMIT 3 OFFSET 5;

3 rows affected.

[(6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('1800.00'))]

### Sorting: `ORDER BY` clause

[[back to top]](#Table-of-Contents)

The SQL ORDER BY clause is used to sort the data in ascending or descending order, based on one or more columns. Some database sorts query results in ascending order by default.

**Syntax:**

    SELECT column-list 
    FROM table_name 
    WHERE [conditions] 
    ORDER BY column1, column2, ..., columnN [ASC | DESC];

In [563]:
# Sort table by salary in ascending order and by name also in ascending order
%sql SELECT * FROM employee \
ORDER BY salary, surname;

15 rows affected.

[(8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('1800.00')),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2000.00')),
 (1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00')),
 (4L, 'Michael', 'Williams', 33L, datetime.date(2010, 2, 2), 'New York', Decimal('2100.00')),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('2500.00')),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00')),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00')),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('3500.00')),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00')),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00')),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00')),
 (5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00'))]

In [564]:
# Sort table by salary in descending order and by name in ascending order
%sql SELECT * FROM employee \
ORDER BY salary DESC, surname ASC;

15 rows affected.

[(5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00')),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4100.00')),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00')),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('3700.00')),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00')),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('3500.00')),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00')),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00')),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('2500.00')),
 (4L, 'Michael', 'Williams', 33L, datetime.date(2010, 2, 2), 'New York', Decimal('2100.00')),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2000.00')),
 (1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00')),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('1800.00'))]

### Grouping: `GROUP BY` clause

[[back to top]](#Table-of-Contents)

The SQL `GROUP BY` clause is used in collaboration with the `SELECT` statement to arrange identical data into groups.

The `GROUP BY` clause follows the `WHERE` clause in a `SELECT` statement and precedes the `ORDER BY` clause.

**Syntax:**

    SELECT column-list [aggregation]
    FROM table_name
    WHERE [conditions]
    GROUP BY column1, column2, ..., columnN
    ORDER BY column1, column2, ..., columnM
    
SQL has many built-in functions for performing calculations on data, which may be used together with `GROUP BY` clause.

**SQL Aggregate Functions** return a single value, calculated from values in a column.

* `AVG()` returns the average value
* `COUNT()` returns the number of rows
* `FIRST()` returns the first value
* `LAST()` returns the last value
* `MAX()` returns the largest value
* `MIN()` returns the smallest value
* `SUM()` returns the sum

**SQL Scalar functions** return a single value, based on the input value.

* `UCASE()` converts a field to upper case
* `LCASE()` converts a field to lower case
* `MID()` extract characters from a text field
* `LEN()` returns the length of a text field
* `ROUND()` rounds a numeric field to the number of decimals specified
* `NOW()` returns the current system date and time
* `FORMAT()` formats how a field is to be displayed

In [565]:
# Find sum of salary for each value of employees' age and count how many employees have this age  
%sql SELECT age, SUM(salary), COUNT(ID) FROM employee \
GROUP BY age;

11 rows affected.

[(23L, Decimal('6600.00'), 2L),
 (24L, Decimal('3700.00'), 1L),
 (28L, Decimal('6200.00'), 2L),
 (29L, Decimal('4800.00'), 1L),
 (32L, Decimal('6700.00'), 2L),
 (33L, Decimal('2100.00'), 1L),
 (36L, Decimal('2000.00'), 1L),
 (38L, Decimal('7200.00'), 2L),
 (41L, Decimal('1800.00'), 1L),
 (45L, Decimal('4100.00'), 1L),
 (48L, Decimal('2500.00'), 1L)]

Applied aggregate functions are displayed in the table with long names. You may replace them using `AS` clause.

In [566]:
# Group records by surname, count for each group average age and the highest salary.
# Sort results by average age and maximum salary and display uppercased surname and 
# specific names for aggregate functions
%sql SELECT UCASE(surname) AS SURNAME, AVG(age) AS avg_age, ROUND(MAX(salary)) AS max_salary FROM employee \
GROUP BY surname \
ORDER BY avg_age, max_salary DESC;

12 rows affected.

[('DAVIS', Decimal('23.0000'), Decimal('3800')),
 ('ALLEN', Decimal('23.0000'), Decimal('2800')),
 ('BROWN', Decimal('28.0000'), Decimal('3500')),
 ('HARRIS', Decimal('28.0000'), Decimal('2700')),
 ('SMITH', Decimal('32.0000'), Decimal('2000')),
 ('TAYLOR', Decimal('32.3333'), Decimal('4700')),
 ('WILLIAMS', Decimal('33.0000'), Decimal('2100')),
 ('JACKSON', Decimal('36.0000'), Decimal('2000')),
 ('JOHNSON', Decimal('38.0000'), Decimal('3700')),
 ('MORGAN', Decimal('38.0000'), Decimal('3500')),
 ('PHILIPS', Decimal('38.5000'), Decimal('4800')),
 ('MILLER', Decimal('45.0000'), Decimal('4100'))]

### Setting conditions on the grouping records: `HAVING` clause

[[back to top]](#Table-of-Contents)

The `HAVING` clause enables you to specify conditions that filter which group results appear in the final results.

The `WHERE` clause places conditions on the selected columns, whereas the `HAVING` clause places conditions on groups created by the `GROUP BY` clause.

**Syntax:**

    SELECT column-list
    FROM table_name
    WHERE [conditions]
    GROUP BY column1, column2, ..., columnN
    HAVING [having_conditions]
    ORDER BY column1, column2, ..., columnM

The `HAVING` clause must follow the `GROUP BY` clause in a query and must also precede the `ORDER BY` clause if used.

In [567]:
# Find sum of salary for each value of employees' age and dislpay only those age groups which contains more than 1 element. 
%sql SELECT age, SUM(salary), COUNT(ID), GROUP_CONCAT(name) AS members FROM employee \
GROUP BY age \
HAVING COUNT(ID) > 1;
# `GROUP_CONCAT` function returns all elements of the group

4 rows affected.

[(23L, Decimal('6600.00'), 2L, 'Elizabeth,Thomas'),
 (28L, Decimal('6200.00'), 2L, 'Robert,George'),
 (32L, Decimal('6700.00'), 2L, 'James,Sarah'),
 (38L, Decimal('7200.00'), 2L, 'Susan,Barbara')]

> ### Exercise 2.4:

> Increase salary by 20% for those employees who is older 35 and display records in descending order by the salary. Write results to the `result` variable.

In [568]:
#%load_ext sql

# type your code here
#result = %sql SELECT * FROM employee WHERE age>35;
#result
#result = %sql UPDATE employee SET salary=salary*1.2 WHERE age>35;
#result
# UPDATE employee SET salary=salary*1.2 WHERE age > 35 ORDER BY salary DESC;
#result = %sql SELECT * FROM employee WHERE age>35 ORDER BY salary DESC; \
#UPDATE employee SET salary=salary*1.2 WHERE age>35;
result = %sql \
SELECT * FROM employee WHERE age>35; \
UPDATE employee SET salary = salary*1.2 WHERE age>35 ORDER BY salary DESC; \
SELECT * FROM employee WHERE age>35 ORDER BY salary DESC;
result

6 rows affected.
6 rows affected.
6 rows affected.

[(7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00')),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('4440.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('4200.00')),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('3000.00')),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00')),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('2160.00'))]

In [569]:
Test.assertEqualsHashed(result, '9cab9a8458e0a2ef65ee99adead075a031d1d3d7', 'Incorrect sql query', "Exercise 2.4 is successful")

1 test failed. Incorrect sql query

> ### Exercise 2.5:

> Calcualte how many employees live in New York and what is its average salary. You need display two columns, where the first one corresponds to employees amount (call it as `count`) and the second contains the average salary (call it as `avg_salary`). Write results to the `result` variable.

In [570]:
# type your code here
result = %sql \
SELECT COUNT(surname) as count, AVG(salary) as avg_salary FROM employee WHERE address='New York';
result

1 rows affected.

[(7L, Decimal('3291.428571'))]

In [571]:
Test.assertEqualsHashed(result, 'f089cf74bda57427f6ed318b8666528464c6f1fa', 'Incorrect sql query', "Exercise 2.5 is successful")

1 test passed. Exercise 2.5 is successful

> ### Exercise 2.6:

> Display only those age groups, that contains more than one element and where the average salary is larger than 3300. You need display also two columns, where the first one corresponds to employees amount in the respective age group (call it as `count`) and the second contains the value of the average salary for this age grouup (call it as `avg_salary`). Write results to the `result` variable.

In [572]:
# type your code here
result = %sql \
SELECT count, avg_salary FROM ( \
    SELECT age, COUNT(ID) AS count, AVG(salary) AS avg_salary FROM employee \
    GROUP BY age \
    HAVING count>1) AS one_table \
ORDER BY count
result
'''
result = %sql \
SELECT ID,name,surname,age,MIN(admission_date) AS admission_date, address, salary FROM ( \
    SELECT * FROM employee \
    WHERE YEAR(admission_date)='2009'\
    ORDER BY ID ASC) AS one_table \
ORDER BY ID ASC
result
'''

4 rows affected.

"\nresult = %sql SELECT ID,name,surname,age,MIN(admission_date) AS admission_date, address, salary FROM (     SELECT * FROM employee     WHERE YEAR(admission_date)='2009'    ORDER BY ID ASC) AS one_table ORDER BY ID ASC\nresult\n"

In [573]:
Test.assertEqualsHashed(result, '79efbd1b8e26c530f4207792058efe30e0ce8721', 
                        'Incorrect sql query', "Exercise 2.6 is successful")

1 test failed. Incorrect sql query

### Remove all table record: `TRANCATE` statement

[[back to top]](#Table-of-Contents)

What if we only want to delete the data inside the table, and not the table itself? Then, use the TRUNCATE TABLE statement:

**Syntax:**

    TRUNCATE TABLE table_name

### Add, delete, modify columns: `ALTER TABLE` statement

[[back to top]](#Table-of-Contents)

The SQL `ALTER TABLE` command is used to add, delete or modify columns in an existing table.

**Syntax:** (_to add a new column in an existing table_)

    ALTER TABLE table_name ADD column_name datatype;

**Syntax:** (_to drop column in an existing table_)

    ALTER TABLE table_name DROP COLUMN column_name;

**Syntax:** (_to change the data type of a column in a table_)

    ALTER TABLE table_name MODIFY COLUMN column_name datatype;

In [574]:
# Add new column 'department' to employee table
%sql ALTER TABLE employee ADD department INT; \
SELECT * FROM employee;

0 rows affected.
15 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00'), None),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00'), None),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('4440.00'), None),
 (4L, 'Michael', 'Williams', 33L, datetime.date(2010, 2, 2), 'New York', Decimal('2100.00'), None),
 (5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00'), None),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00'), None),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00'), None),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('2160.00'), None),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00'), None),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00'), None),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00'), None),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00'), None),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('3000.00'), None),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('4200.00'), None),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'), None)]

In [575]:
# Let's change department values
%sql UPDATE employee SET department = 1 WHERE ID IN (1, 4, 11); \
UPDATE employee SET department = 2 WHERE ID IN (3, 10); \
UPDATE employee SET department = 3 WHERE ID IN (2, 5, 6, 15); \
UPDATE employee SET department = 4 WHERE ID IN (8, 12); \
UPDATE employee SET department = 6 WHERE ID = 16; \
UPDATE employee SET department = 8 WHERE ID = 14; \
SELECT * FROM employee;

3 rows affected.
2 rows affected.
4 rows affected.
2 rows affected.
1 rows affected.
1 rows affected.
15 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00'), 1L),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00'), 3L),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('4440.00'), 2L),
 (4L, 'Michael', 'Williams', 33L, datetime.date(2010, 2, 2), 'New York', Decimal('2100.00'), 1L),
 (5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00'), 3L),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00'), 3L),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00'), None),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('2160.00'), 4L),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00'), 2L),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00'), 1L),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00'), 4L),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00'), None),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('3000.00'), 8L),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('4200.00'), 3L),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'), 6L)]

### SQL joins

[[back to top]](#Table-of-Contents)

The SQL joins clause is used to combine records from two or more tables in a database. A `JOIN` is a means for combining fields from two tables by using values common to each.

There are different types of joins available in SQL:

* `INNER JOIN`: returns rows when there is a match in both tables.
* `LEFT JOIN`: returns all rows from the left table, even if there are no matches in the right table.
* `RIGHT JOIN`: returns all rows from the right table, even if there are no matches in the left table.

Of course, in the simplest variants we can join data from two tables using `WHERE` clause. To demonstrate this, at first we need create a new SQL table `department` containg data about departments where persons from `employee` table work.

In [576]:
# Create a new table containing departments 
%sql CREATE TABLE department ( \
   ID              INT              NOT NULL, \
   title            VARCHAR (50)     NOT NULL,     /* Department name */ \
   PRIMARY KEY (ID) \
);

# Fill the `department` table with data
%sql \
INSERT INTO department VALUES (1,  'Purchasing department');         \
INSERT INTO department VALUES (2,  'Export department');             \
INSERT INTO department VALUES (3,  'Research and development team'); \
INSERT INTO department VALUES (4,  'Management');                    \
INSERT INTO department VALUES (5,  'Marketing');                     \
INSERT INTO department VALUES (6,  'Accounting department');         \
INSERT INTO department VALUES (7,  'Administrative accounting');     \
INSERT INTO department VALUES (8,  'IT department');                 \
INSERT INTO department VALUES (9,  'Customer service');              \
INSERT INTO department VALUES (10, 'Logistics');                     

# Display just created table
%sql SELECT * FROM department

0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
10 rows affected.

[(1L, 'Purchasing department'),
 (2L, 'Export department'),
 (3L, 'Research and development team'),
 (4L, 'Management'),
 (5L, 'Marketing'),
 (6L, 'Accounting department'),
 (7L, 'Administrative accounting'),
 (8L, 'IT department'),
 (9L, 'Customer service'),
 (10L, 'Logistics')]

Both tables contain common field (column) - `department` column in `employee` table corresponds to `ID` column in `department` table. These two columns define the relationship between `department` and `employee` tables. 

Let's combine data from both tables based on common field.

In [577]:
# We can call the field of a table thus `table_name.column_name`
%sql SELECT surname, name, age, title \
FROM employee, department \
WHERE employee.department = department.ID;

13 rows affected.

[('Smith', 'James', 32L, 'Purchasing department'),
 ('Brown', 'Robert', 28L, 'Research and development team'),
 ('Johnson', 'Susan', 38L, 'Export department'),
 ('Williams', 'Michael', 33L, 'Purchasing department'),
 ('Philips', 'Richard', 29L, 'Research and development team'),
 ('Davis', 'Elizabeth', 23L, 'Research and development team'),
 ('Taylor', 'Donna', 41L, 'Management'),
 ('Allen', 'Thomas', 23L, 'Export department'),
 ('Taylor', 'Joseph', 24L, 'Purchasing department'),
 ('Harris', 'George', 28L, 'Management'),
 ('Philips', 'Steven', 48L, 'IT department'),
 ('Morgan', 'Barbara', 38L, 'Research and development team'),
 ('Taylor', 'Sarah', 32L, 'Accounting department')]

#### `INNER JOIN` clause

[[back to top]](#Table-of-Contents)

The most frequently used and important of the joins is the `INNER JOIN`. 

The `INNER JOIN` creates a new result table by combining column values of two tables (table1 and table2) based upon the join-predicate. The query compares each row of table1 with each row of table2 to find all pairs of rows which satisfy the join-predicate. When the join-predicate is satisfied, column values for each matched pair of rows of A and B are combined into a result row.

**Syntax:**

    SELECT table1.column1, table2.column2, ...
    FROM table1
    INNER JOIN table2
    ON table1.common_field = table2.common_field;

In [578]:
# Note, if both tables contain the same called field, 
# we should call it with respect to corresponding column like `table_name.column_name`
%sql SELECT employee.ID, CONCAT(surname, ' ', name) AS person, title \
    FROM employee \
    INNER JOIN department \
    ON employee.department = department.ID;
# `CONCAT` function concatenates two or more strings to a single string

13 rows affected.

[(1L, 'Smith James', 'Purchasing department'),
 (2L, 'Brown Robert', 'Research and development team'),
 (3L, 'Johnson Susan', 'Export department'),
 (4L, 'Williams Michael', 'Purchasing department'),
 (5L, 'Philips Richard', 'Research and development team'),
 (6L, 'Davis Elizabeth', 'Research and development team'),
 (8L, 'Taylor Donna', 'Management'),
 (10L, 'Allen Thomas', 'Export department'),
 (11L, 'Taylor Joseph', 'Purchasing department'),
 (12L, 'Harris George', 'Management'),
 (14L, 'Philips Steven', 'IT department'),
 (15L, 'Morgan Barbara', 'Research and development team'),
 (16L, 'Taylor Sarah', 'Accounting department')]

#### `LEFT JOIN` clause

[[back to top]](#Table-of-Contents)

The SQL `LEFT JOIN` returns all rows from the left table, even if there are no matches in the right table. This means that if the `ON` clause matches 0 (zero) records in right table, the join will still return a row in the result, but with `NULL` in each column from right table.

This means that a left join returns all the values from the left table, plus matched values from the right table or `NULL` in case of no matching join predicate.

**Syntax:**

    SELECT table1.column1, table2.column2, ...
    FROM table1
    LEFT JOIN table2
    ON table1.common_field = table2.common_field;

In [579]:
%sql SELECT employee.ID, CONCAT(surname, ' ', name) AS person, title \
    FROM employee \
    LEFT JOIN department \
    ON employee.department = department.ID;

15 rows affected.

[(1L, 'Smith James', 'Purchasing department'),
 (2L, 'Brown Robert', 'Research and development team'),
 (3L, 'Johnson Susan', 'Export department'),
 (4L, 'Williams Michael', 'Purchasing department'),
 (5L, 'Philips Richard', 'Research and development team'),
 (6L, 'Davis Elizabeth', 'Research and development team'),
 (7L, 'Miller Susan', None),
 (8L, 'Taylor Donna', 'Management'),
 (10L, 'Allen Thomas', 'Export department'),
 (11L, 'Taylor Joseph', 'Purchasing department'),
 (12L, 'Harris George', 'Management'),
 (13L, 'Jackson Brian', None),
 (14L, 'Philips Steven', 'IT department'),
 (15L, 'Morgan Barbara', 'Research and development team'),
 (16L, 'Taylor Sarah', 'Accounting department')]

#### `RIGHT JOIN` clause

[[back to top]](#Table-of-Contents)

The SQL `RIGHT JOIN` returns all rows from the right table, even if there are no matches in the left table. This means that if the `ON` clause matches 0 (zero) records in left table, the join will still return a row in the result, but with `NULL` in each column from left table.

This means that a right join returns all the values from the right table, plus matched values from the left table or `NULL` in case of no matching join predicate.

**Syntax:**

    SELECT table1.column1, table2.column2...
    FROM table1
    RIGHT JOIN table2
    ON table1.common_field = table2.common_field;

In [580]:
%sql SELECT employee.ID, CONCAT(surname, ' ', name) AS person, title \
    FROM employee \
    RIGHT JOIN department \
    ON employee.department = department.ID;

17 rows affected.

[(1L, 'Smith James', 'Purchasing department'),
 (2L, 'Brown Robert', 'Research and development team'),
 (3L, 'Johnson Susan', 'Export department'),
 (4L, 'Williams Michael', 'Purchasing department'),
 (5L, 'Philips Richard', 'Research and development team'),
 (6L, 'Davis Elizabeth', 'Research and development team'),
 (8L, 'Taylor Donna', 'Management'),
 (10L, 'Allen Thomas', 'Export department'),
 (11L, 'Taylor Joseph', 'Purchasing department'),
 (12L, 'Harris George', 'Management'),
 (14L, 'Philips Steven', 'IT department'),
 (15L, 'Morgan Barbara', 'Research and development team'),
 (16L, 'Taylor Sarah', 'Accounting department'),
 (None, None, 'Marketing'),
 (None, None, 'Administrative accounting'),
 (None, None, 'Customer service'),
 (None, None, 'Logistics')]

### `UNION` clause/operator

[[back to top]](#Table-of-Contents)

The SQL `UNION` clause/operator is used to combine the results of two or more `SELECT` statements without returning any duplicate rows.

To use `UNION`, each `SELECT` must have the same number of columns selected, the same number of column expressions, the same data type, and have them in the same order, but they do not have to be the same length.

**Syntax:**

    SELECT column1 [, column2, ...]
    FROM table1 [, table2, ...]
    [WHERE conditions]

    UNION

    SELECT column1 [, column2, ...]
    FROM table1 [, table2, ...]
    [WHERE conditions]

In [581]:
# Abouve joins contains all records of `employee` table and a part of records of `department` table.
# Let's display all values of both tables
%sql SELECT employee.ID AS employee_ID, surname, name, age, department AS department_ID, title \
     FROM employee \
     LEFT JOIN department \
     ON employee.department = department.ID \
UNION \
     SELECT employee.ID AS employee_ID, surname, name, age, department AS department_ID, title \
     FROM employee \
     RIGHT JOIN department \
     ON employee.department = department.ID;

19 rows affected.

[(1L, 'Smith', 'James', 32L, 1L, 'Purchasing department'),
 (2L, 'Brown', 'Robert', 28L, 3L, 'Research and development team'),
 (3L, 'Johnson', 'Susan', 38L, 2L, 'Export department'),
 (4L, 'Williams', 'Michael', 33L, 1L, 'Purchasing department'),
 (5L, 'Philips', 'Richard', 29L, 3L, 'Research and development team'),
 (6L, 'Davis', 'Elizabeth', 23L, 3L, 'Research and development team'),
 (7L, 'Miller', 'Susan', 45L, None, None),
 (8L, 'Taylor', 'Donna', 41L, 4L, 'Management'),
 (10L, 'Allen', 'Thomas', 23L, 2L, 'Export department'),
 (11L, 'Taylor', 'Joseph', 24L, 1L, 'Purchasing department'),
 (12L, 'Harris', 'George', 28L, 4L, 'Management'),
 (13L, 'Jackson', 'Brian', 36L, None, None),
 (14L, 'Philips', 'Steven', 48L, 8L, 'IT department'),
 (15L, 'Morgan', 'Barbara', 38L, 3L, 'Research and development team'),
 (16L, 'Taylor', 'Sarah', 32L, 6L, 'Accounting department'),
 (None, None, None, None, None, 'Marketing'),
 (None, None, None, None, None, 'Administrative accounting'),
 (None, None, None, None, None, 'Customer service'),
 (None, None, None, None, None, 'Logistics')]

The `UNION ALL` operator is used to combine the results of two `SELECT` statements including duplicate rows.

The same rules that apply to `UNION` apply to the `UNION ALL` operator.

**Syntax:**

    SELECT column1 [, column2, ...]
    FROM table1 [, table2, ...]
    [WHERE conditions]

    UNION ALL

    SELECT column1 [, column2, ...]
    FROM table1 [, table2, ...]
    [WHERE conditions]

In [582]:
%sql SELECT employee.ID AS employee_ID, surname, name, age, department AS department_ID, title \
     FROM employee \
     LEFT JOIN department \
     ON employee.department = department.ID \
UNION ALL\
     SELECT employee.ID AS employee_ID, surname, name, age, department AS department_ID, title \
     FROM employee \
     RIGHT JOIN department \
     ON employee.department = department.ID;

32 rows affected.

[(1L, 'Smith', 'James', 32L, 1L, 'Purchasing department'),
 (2L, 'Brown', 'Robert', 28L, 3L, 'Research and development team'),
 (3L, 'Johnson', 'Susan', 38L, 2L, 'Export department'),
 (4L, 'Williams', 'Michael', 33L, 1L, 'Purchasing department'),
 (5L, 'Philips', 'Richard', 29L, 3L, 'Research and development team'),
 (6L, 'Davis', 'Elizabeth', 23L, 3L, 'Research and development team'),
 (7L, 'Miller', 'Susan', 45L, None, None),
 (8L, 'Taylor', 'Donna', 41L, 4L, 'Management'),
 (10L, 'Allen', 'Thomas', 23L, 2L, 'Export department'),
 (11L, 'Taylor', 'Joseph', 24L, 1L, 'Purchasing department'),
 (12L, 'Harris', 'George', 28L, 4L, 'Management'),
 (13L, 'Jackson', 'Brian', 36L, None, None),
 (14L, 'Philips', 'Steven', 48L, 8L, 'IT department'),
 (15L, 'Morgan', 'Barbara', 38L, 3L, 'Research and development team'),
 (16L, 'Taylor', 'Sarah', 32L, 6L, 'Accounting department'),
 (1L, 'Smith', 'James', 32L, 1L, 'Purchasing department'),
 (2L, 'Brown', 'Robert', 28L, 3L, 'Research and development team'),
 (3L, 'Johnson', 'Susan', 38L, 2L, 'Export department'),
 (4L, 'Williams', 'Michael', 33L, 1L, 'Purchasing department'),
 (5L, 'Philips', 'Richard', 29L, 3L, 'Research and development team'),
 (6L, 'Davis', 'Elizabeth', 23L, 3L, 'Research and development team'),
 (8L, 'Taylor', 'Donna', 41L, 4L, 'Management'),
 (10L, 'Allen', 'Thomas', 23L, 2L, 'Export department'),
 (11L, 'Taylor', 'Joseph', 24L, 1L, 'Purchasing department'),
 (12L, 'Harris', 'George', 28L, 4L, 'Management'),
 (14L, 'Philips', 'Steven', 48L, 8L, 'IT department'),
 (15L, 'Morgan', 'Barbara', 38L, 3L, 'Research and development team'),
 (16L, 'Taylor', 'Sarah', 32L, 6L, 'Accounting department'),
 (None, None, None, None, None, 'Marketing'),
 (None, None, None, None, None, 'Administrative accounting'),
 (None, None, None, None, None, 'Customer service'),
 (None, None, None, None, None, 'Logistics')]

### `NULL` values

[[back to top]](#Table-of-Contents)

The SQL `NULL` is the term used to represent a missing value. A `NULL` value in a table is a value in a field that appears to be blank.

A field with a `NULL` value is a field with no value. It is very important to understand that a `NULL` value is different than a zero value or a field that contains spaces. A field with a `NULL` value is one that has been left blank during record creation.

You should use the `IS NULL` or `IS NOT NULL` operators in order to check for a `NULL` value.

In [583]:
%sql SELECT * FROM employee WHERE department IS NULL

2 rows affected.

[(7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00'), None),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00'), None)]

### Subquery

[[back to top]](#Table-of-Contents)

A Subquery (or Inner query or Nested query) is a query within another SQL query and embedded within the `WHERE` clause.

A subquery is used to return data that will be used in the main query as a condition to further restrict the data to be retrieved. Subqueries can be used with the `SELECT`, `INSERT`, `UPDATE`, and `DELETE` statements along with the operators like `=`, `<`, `>`, `>=`, `<=`, `IN`, `BETWEEN` etc.

There are a few rules that subqueries must follow:

* Subqueries must be enclosed within parentheses.
* A subquery can have only one column in the `SELECT` clause, unless multiple columns are in the main query for the subquery to compare its selected columns.
* An `ORDER BY` cannot be used in a subquery, although the main query can use an `ORDER BY`. The `GROUP BY` can be used to perform the same function as the `ORDER BY` in a subquery.
* Subqueries that return more than one row can only be used with multiple value operators, such as the `IN` operator.
* A subquery cannot be immediately enclosed in a set function.
* The `BETWEEN` operator cannot be used with a subquery; however, the `BETWEEN` operator can be used within the subquery.

Subqueries are most frequently used with the `SELECT` statement. 

**Syntax:**

    SELECT column-list
    FROM table1 [, table2, ...]
    WHERE column_name OPERATOR
          (SELECT column-list-2
           FROM table1 [, table2, ...]
           [WHERE conditions])

In [584]:
# Let's calcualte the average salary 
%sql SELECT AVG(salary) FROM employee;

1 rows affected.

[(Decimal('3414.666667'),)]

In [585]:
# And then display only those person who has the salary less than the average salary over all employee 
%sql SELECT * FROM employee \
     WHERE salary < (SELECT AVG(salary) FROM employee);

7 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00'), 1L),
 (4L, 'Michael', 'Williams', 33L, datetime.date(2010, 2, 2), 'New York', Decimal('2100.00'), 1L),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('2160.00'), 4L),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00'), 2L),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00'), 4L),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00'), None),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('3000.00'), 8L)]

SQL allows using of an arbitrary amount of nested subqueries. 

Let's find all employees, who has the age between the minimal age amoung those, that correspond to the salary not less than the maximal salary, and maximal age of the persons, who recieve the payment over the average salary.

In [586]:
%sql SELECT * FROM employee \
     WHERE age BETWEEN \
         (SELECT MIN(age) FROM employee WHERE salary >= (SELECT MAX(salary) FROM employee)) \
     AND \
         (SELECT MAX(age) FROM employee WHERE salary > (SELECT AVG(salary) FROM employee));

1 rows affected.

[(7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00'), None)]

### Some Date functions

[[back to top]](#Table-of-Contents)

Following is a list of some important Date and Time related functions available through SQL. There are various other functions supported by your RDBMS. Given list is based on MySQL RDBMS.

|Name|Description|
|-----|-----|
|`ADDDATE()`|Adds dates|
|`ADDTIME()`|Adds time|
|`CURDATE()`|Returns the current date|
|`DATE_ADD()`|Adds two dates|
|`CURTIME()`|Returns the current time|
|`DATE_FORMAT()`|Formats date as specified|
|`DATE_SUB()`|Subtracts two dates|
|`DATE()`|Extracts the date part of a date or datetime expression|
|`DATEDIFF()`|Subtracts two dates|
|`DAYNAME()`|Returns the name of the weekday|
|`DAYOFMONTH()`|Returns the day of the month (1-31)|
|`DAYOFWEEK()`|Returns the weekday index of the argument|
|`DAYOFYEAR()`|Returns the day of the year (1-366)|
|`HOUR()`|Extracts the hour|
|`MINUTE()`|Returns the minute from the argument|
|`MONTH()`|Return the month from the date passed|
|`MONTHNAME()`|Returns the name of the month|
|`NOW()`|Returns the current date and time|
|`QUARTER()`|Returns the quarter from a date argument|
|`SECOND()`|Returns the second (0-59)|
|`TIME_FORMAT()`|Formats as time|
|`TIME()`|Extracts the time portion of the expression passed|
|`WEEK()`|Returns the week number|
|`WEEKDAY()`|Returns the weekday index|
|`YEAR()`|Returns the year|

The full list of Date functions can be found [here](https://dev.mysql.com/doc/refman/5.5/en/date-and-time-functions.html).

In [587]:
# Display current date and time
%sql SELECT CURDATE(), CURTIME(), NOW();

1 rows affected.

[(datetime.date(2019, 1, 18), datetime.timedelta(0, 47120), datetime.datetime(2019, 1, 18, 13, 5, 20))]

In [588]:
# Extract year, month, etc. from the current date
%sql SELECT YEAR(NOW()) AS year, \
     QUARTER(NOW()) AS quarter, \
     MONTH(NOW()) AS month, MONTHNAME(NOW()) AS month_name, \
     DAY(NOW()) AS day, DAYNAME(NOW()) AS day_name, \
     HOUR(NOW()) AS hour, \
     MINUTE(NOW()) AS minute, \
     SECOND(NOW()) AS second, \
     MICROSECOND(NOW()) microseconds;

1 rows affected.

[(2019L, 1L, 1L, 'January', 18L, 'Friday', 13L, 5L, 20L, 0L)]

In [589]:
# Let's what date will be for 31 days and what date was 31 hours ago
%sql SELECT DATE( DATE_ADD(NOW(), INTERVAL 31 DAY) ) AS for_31_days, \
            DATE( DATE_SUB(NOW(), INTERVAL 31 HOUR) ) AS for_31_days;

1 rows affected.

[(datetime.date(2019, 2, 18), datetime.date(2019, 1, 17))]

In [590]:
# Select employees who was hired in the first two quarters of 2009
%sql SELECT * FROM employee \
     WHERE YEAR(admission_date) = 2009 AND QUARTER(admission_date) IN (1,2);

5 rows affected.

[(3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('4440.00'), 2L),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00'), 3L),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00'), None),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00'), None),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'), 6L)]

In [591]:
# Select employees who was hired after date, when the last (if there are a few the same values) youngest person was hired
%sql SELECT * FROM employee \
     WHERE admission_date > ( \
         SELECT MAX(admission_date) FROM employee WHERE age = (SELECT MIN(age) FROM employee) \
     );

5 rows affected.

[(4L, 'Michael', 'Williams', 33L, datetime.date(2010, 2, 2), 'New York', Decimal('2100.00'), 1L),
 (5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00'), 3L),
 (8L, 'Donna', 'Taylor', 41L, datetime.date(2010, 5, 8), 'New Jersey', Decimal('2160.00'), 4L),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00'), 1L),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00'), 4L)]

> ### Exercise 2.7:

> Select employees who were hired between 01/01/2008 and 06/01/2009 (date format is MM/DD/YYYY) without the department column and sort by ID in the ascending order. Write results to the `result` variable.

In [592]:
# type your code here
result = %sql \
SELECT ID,name,surname,age,admission_date, address, salary FROM employee \
WHERE admission_date BETWEEN '2008-01-01' AND '2009-06-01' \
ORDER BY ID ASC;
result

9 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00')),
 (2L, 'Robert', 'Brown', 28L, datetime.date(2008, 7, 1), 'Jersey City', Decimal('3500.00')),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('4440.00')),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00')),
 (10L, 'Thomas', 'Allen', 23L, datetime.date(2008, 1, 15), 'New York', Decimal('2800.00')),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00')),
 (14L, 'Steven', 'Philips', 48L, datetime.date(2008, 2, 20), 'Jersey City', Decimal('3000.00')),
 (15L, 'Barbara', 'Morgan', 38L, datetime.date(2008, 3, 10), 'New York', Decimal('4200.00')),
 (16L, 'Sarah', 'Taylor', 32L, datetime.date(2009, 4, 24), 'Edison', Decimal('4700.00'))]

In [593]:
Test.assertEqualsHashed(result, '3743a45647ce805e6b0ef888b695ecb0e49082e8', 'Incorrect sql query', "Exercise 2.7 is successful")

1 test passed. Exercise 2.7 is successful

> ### Exercise 2.8:

> Group employees by the year of its admission and display three columns: the average age in each group (call it as `avg_age`), the age of the youngest employee in each group (call this column as `min_age`) and the admission's year (call it as `year`). The result table should be ordered by `min_age` value in ascending order, but if there are a few rows with the same `min_age` value, then you need order rows by `avg_age` value also in ascending order. Write results to the `result` variable.

In [594]:
# type your code here

result = %sql \
SELECT * FROM ( \
    SELECT AVG(age) AS avg_age, MIN(age) AS min_age, YEAR(admission_date) AS year FROM employee \
    GROUP BY year) AS age_table \
ORDER BY min_age ASC, avg_age ASC
result

3 rows affected.

[(Decimal('31.8750'), 23L, 2009L),
 (Decimal('33.8000'), 23L, 2008L),
 (Decimal('37.0000'), 33L, 2010L)]

In [595]:
Test.assertEqualsHashed(result, '3644ccc34f4e7e5380789857e6258e2bc4173aa7', 'Incorrect sql query', "Exercise 2.8 is successful")

1 test passed. Exercise 2.8 is successful

> ### Exercise 2.9:


> Find the employee who was the first hired in 2009 and display all employees who were hired for 180 days before and after this person without the department column, also sort the result by ID in the ascending order. Pay attention that the employee who was hired in 2009 before all other should not be included in the resulting SQL table. Write results to the `result` variable.

In [596]:
# type your code here
result = %sql \
SELECT * FROM employee \
    WHERE admission_date BETWEEN \
    (SELECT DATE_SUB((SELECT MIN(admission_date) FROM employee WHERE YEAR(admission_date)='2009'), INTERVAL 180 DAY)) \
    AND \
    (SELECT DATE_ADD((SELECT MIN(admission_date) FROM employee WHERE YEAR(admission_date)='2009'), INTERVAL 180 DAY)) \
ORDER BY ID ASC \
LIMIT 8
result
#SELECT * FROM employee WHERE YEAR(admission_date)='2009'
#result = %sql \
#SELECT DATE_ADD('2009-04-24', INTERVAL 180 DAY)
#result

8 rows affected.

[(1L, 'James', 'Smith', 32L, datetime.date(2008, 11, 11), 'New York', Decimal('2000.00'), 1L),
 (3L, 'Susan', 'Johnson', 38L, datetime.date(2009, 5, 21), 'New York', Decimal('4440.00'), 2L),
 (5L, 'Richard', 'Philips', 29L, datetime.date(2009, 9, 27), 'Jersey City', Decimal('4800.00'), 3L),
 (6L, 'Elizabeth', 'Davis', 23L, datetime.date(2009, 6, 21), 'New York', Decimal('3800.00'), 3L),
 (7L, 'Susan', 'Miller', 45L, datetime.date(2009, 5, 12), 'Newark', Decimal('4920.00'), None),
 (11L, 'Joseph', 'Taylor', 24L, datetime.date(2009, 7, 24), 'New York', Decimal('3700.00'), 1L),
 (12L, 'George', 'Harris', 28L, datetime.date(2009, 8, 17), 'Stamfod', Decimal('2700.00'), 4L),
 (13L, 'Brian', 'Jackson', 36L, datetime.date(2009, 5, 5), 'Stamfod', Decimal('2400.00'), None)]

In [597]:
Test.assertEqualsHashed(result, '8515b1f60e3783cbce5806687c175176ddee67c4', 'Incorrect sql query', "Exercise 2.9 is successful")

1 test failed. Incorrect sql query

<center><h3>Presented by <a target="_blank" rel="noopener noreferrer nofollow" href="http://datascience-school.com">datascience-school.com</a></h3></center>